In [2]:
import pandas as pd 
import numpy as np
from matplotlib import pyplot as plt

In [3]:
df = pd.read_excel("Rent.xlsx")

# DATA ANALYSIS

In [4]:
df.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [5]:
df.tail()

    area   rent
55  3100  54000
56  2750  48500
57  1800  25100
58  2200  31560
59  3100  51600

In [6]:
df.head(7)

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100
5  1900  32500
6  1500  20000

In [7]:
df[5:10]

   area   rent
5  1900  32500
6  1500  20000
7  1850  24500
8  2700  48000
9  2100  31000

In [8]:
df["rent"].head()

0    31500
1    35000
2    41050
3    36100
4    52100
Name: rent, dtype: int64

In [9]:
df.mean()

area     2289.000000
rent    37269.166667
dtype: float64

In [10]:
df.area.mean()

2289.0

In [11]:
df.describe()

              area          rent
count    60.000000     60.000000
mean   2289.000000  37269.166667
std     538.880509  11770.736234
min    1200.000000  20000.000000
25%    1900.000000  31000.000000
50%    2130.000000  34450.000000
75%    2700.000000  47625.000000
max    3500.000000  70500.000000

In [12]:
df.all()

area    True
rent    True
dtype: bool

In [13]:
df.area.std()

538.8805093801691

In [14]:
row , col = df.shape

In [15]:
df.isnull().sum()

area    0
rent    0
dtype: int64